/**
 * quantclass-client
 * Copyright (c) 2025 量化小讲堂
 *
 * Licensed under the Business Source License 1.1 (BUSL-1.1).
 * Additional Use Grant: None
 * Change Date: 2028-08-22 | Change License: GPL-3.0-or-later
 * See the LICENSE file and https://mariadb.com/bsl11/
 */

export const INTRO_PROMO_2025_MARKDOWN = `<center>一、策略分享会</center>

策略分享会专注<font color="red">大A、b圈</font>等所有可交易市场的量化策略分享、共研，注重实操。

从2019年开始第1期。之后每年一期，经历了2020、2021、2022、2023、2024，到现在的2025已是第7期。

**一个小秘密**：往期分享会同学继续参加下期的比例是<font color="red">83%+</font>。这是我最看重也较满意的数字，说明大家感受到了价值。

即将结束的2024分享会，也确实花了很多的精力。160+期直播（平均2天一次）、18条研究船队、1000+篇精华帖、新发布的数据/实盘客户端、快速迭代的框架和工具、4场线下聚会...做出了我心目中87%的样子吧！

链接：[2024策略分享会直播内容](https://www.quantclass.cn/fen/class/fen-2024)

我们也制作了[2024年策略分享会的快速学习指南](https://qtcls.cn/46246)，来帮助大家提升学习效率。

也可以看一下关于往年分享会的700+条评价，每一条都来自于7年如一日的用心服务。看完后大概也会和我一样感动：

链接：[往年策略分享会评价](https://5fzm0.xetslk.com/s/SBM14)

做到现在的第7期，我整体比较平静。

一是知道很多**虽然没见过面但是好像已经成为老朋友**的人肯定会继续来。

二是对每年分享会内容的自信，我打心眼里觉得，不参加是你的损失。

<font color="red">甚至略有些伤感，想到天下无不散之筵席。</font>

不管怎样，2025还是继续努力，继续打造这个「产品」，争取做出心目中90%的样子！

<center>二、2025分享会新特点</center>

<center>1.新特点：客户端化、付费写策略服务</center>
原先策略回测、实盘交易给大家的都是代码，无编程基础的同学学习成本很高。

2025年分享会将实现**全面客户端化**，让编程弱的同学可以摆脱代码的束缚，更多时间花在策略研究上。

为此我们在2023年末推出了**股票数据客户端**、24年又开发了**股票实盘客户端**，25年会进一步丰富客户端的功能，还会集成股票回测模块。
![分享会-2](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760084026564-kxqogao72.png)
25年也会推出**b圈实盘配置网页**，在网页上点点鼠标，自动生成config，就能连接服务器自动运行策略。还能实时观察到策略的运行状态。
![分享会-3](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760084556386-lg3md1uwk.png)
当然，原先的代码仍然会继续提供。并且，客户端的全套代码，我们也会以半开源的方式，让大家监督。

在同时提供客户端、以及代码的情况下，25年我们还准备尝试提供**付费写策略服务**。
![分享会-4](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760085014211-nuxur2axw.png)
对于编程小白来说，如果你既没时间又想躺平，客户端已经足够覆盖你的全部需求。

如果你愿意花时间做研究，也可以在使用客户端的同时，在<font color="red">@分享会专属助教林奇</font> 的帮助下，尝试做部分代码的修改。

甚至如果你想要实现个性化的投资思路，林奇还可以额外提供**付费的编程服务**。（会很贵，但肯定只会是成本价）

当然，如果你是编程老鸟，自由度就会很高，可以随意把玩客户端，重度修改代码，或去深度开发策略。

<center>2.关键词：软知识</center>

在24年分享会中，我通过直播、发帖、群聊等方式，多次向大家提示行情的风险与机会、不同策略运行的时机与加仓点等

这类“软交付”，也是分享会的精华之一。

链接：[24年分享会硬核“软”交付总结](https://bbs.quantclass.cn/thread/49552)

因为我的提示相对比较准确，很多同学会问我：

为什么你的加仓点会比较准？对行情的判断相对更靠谱？总能在关键时刻做出关键提示？即使和你一样的策略，也没你跑的好？

![分享会-5](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760085306438-3b6i84xws.png)

这本质上还是因为我拥有更多交易的<font color="red">「软知识」</font>。

交易心态良好，软知识到位，那么哪怕你的策略比较普通，也能赚钱。反之如果交易心态不行，软知识缺乏，那么即使你的策略再厉害，也很难赚钱。

所以在25年分享会中，将在原来硬核内容分享的基础上，**新增**「软知识」系列内容。

从交易心态、对不同策略的认知和使用、策略切换、如何面对回撤、对回测的认知等方面，系统性的对此进行讲解。

有过亲身交易经历的，都应该知道以上的内容到底有多重要。

<center>3.关键词：我的计划</center>

25年我会降低在分享会日常工作的投入时间，花更多的时间在：

1、大量读书：可能给你们写读书笔记

2、锻炼身体：等着25年葫芦晚会给你们直播倒立

3、交友见人：见更多的人，发现更多的机会

还会花更多的时间在团队的选人、培养人方面。这是我之前做的很不好的地方，希望在25年能有所进步。

我会允许团队年轻人犯更多的错，帮助他们的成长。这也可以让整个「彩虹集团」更健康、长远的发展。

同时也会投入很大一部分时间在分享会牛马船队上。助力牛马的研究，也为分享会提供更多研究方向。（牛马船队介绍见后文）

<center>三、2025分享会「四大灵魂」</center>

灵魂1：邢不行直播

12+期策略直播（24年承诺12期，实际做了22期）：每一期都是一个硬核量化策略，需要反复回看学习。

4期茶会话直播（24年承诺4期，实际做了6期）：注重交易经验分享，轻松愉快，关注行情，建设心态，以及不用写代码的轻策略。

软知识直播（25年新增系列，至少安排4期）：对涉及到交易的“软知识”如回测的认知、交易心态等方面做系统性的讲解，增加大家做决策的能力。

灵魂2：实操船队

针对若干不同的策略研究方向，开启为期3-4个月的研究船队，每年3期。大家按自己的兴趣上船，在船长的指导下，和同行的船员共同完成任务，互相学习，实操交易。

灵魂3：论坛、群、线下研讨会

拥有6000篇精华帖的专属量化论坛为你打开权限，供深度讨论；优质微信群即时交流问题；线下研讨会深度链接交流。

让大家一直留在分享会的，不仅是我的直播，还有这里太多同频的新老朋友。

灵魂4：数据、api、工具...

分享会成员可以获得网站策略、数据的一年免费使用权。其中数据堪比专业金融数据库，由@数据管家-耶伦 全职维护，目前总共上线数据129个，API数据36个，仍在不断丰富中。
![分享会-6](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760087447737-4sdg4i3cu.jpeg)

链接：[我们的数据](https://www.quantclass.cn/data/stock/category)

还可以免费享受我为大家申请的期货全网最低手续费和股票自动交易工具QMT。24年我们在过往基础上，为大家新增了6家券商做选择。

25年分享会成员还可以获得邢不行股票客户端和b圈实盘配置网页的一年免费使用权，即使不会代码的小白同学也可以借助客户端实现策略回测和实盘交易自由。

还有什么呢？

每年分享会都有预期之外的内容。比如论坛、qmt、船队、电话录音系列、牛马直播系列、学废菌小白攻略系列、客户端等，都是随着大家的需求反馈而增加的。

25年又有什么新玩意呢？我也很期待。

<center>四、2025分享会内容：直播</center>

24年分享会累计直播160+期，其中邢不行直播40+期。

25年直播不追求数量，追求质量，预期不会少于100期。

分享会的内容量是非常惊人的，学习量相当于读一个研究生。

<center>1.邢不行12期策略直播</center>

25年分享会我将至少进行12次直播，每次时长1小时+。

（24年分享会我实际直播了22期，直播时长都在1.5小时以上）

每次直播都涉及硬核量化策略，内容主要覆盖股票、b圈等市场。

所有直播都由我亲自讲解。直播策略的最新信号、相关数据、完整代码，都会放到网站上，方便大家实盘使用与二次开发。

（可参考24分享会相关内容：策略直播）

<center>2.邢不行4期茶话会直播</center>

茶话会系列直播会比较轻松愉快。听的时候务必准备好零食饮料，因为我讲的时候也会喝着奶啤。

茶话会注重交易中的经验分享，也会关注当前行情，分享我的交易计划。也会介绍一些方便实施甚至不用写代码的轻策略。

（可参考24分享会相关内容：茶话会直播）

<center>3.软知识直播</center>

25年分享会我将新增至少4期“软知识”直播（可能会有6到8期）。

涉及到的内容会以交易中的软知识为主，不会像策略直播那样硬核，但会更多元，更系统化。

![分享会-7](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760149196070-cdylzct97.png)
关于软知识直播的详细说明，请见2025分享会介绍视频的35:16 - 44:12

<center>4.电话录音</center>

电话录音系列是22年开始新增的一个系列。

![分享会-8](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760149308973-q2vd32iys.png)

在平时和分享会同学的电话沟通中，我会把我认为有价值部分的录音上传，供大家收听。

当然我极其注重大家的隐私，会严格删除敏感信息，并只有在征得同意后才会上传。

有同学说这是他最爱听的系列，因为涉及到了非常多的实操内容。（虽然我知道你最爱听的真实原因是因为听这个最简单）
![分享会-9](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760149410067-scefs8yof.png)

<center>5.学废菌小白攻略</center>

「小白攻略」系列直播是2024年分享会新增的系列，由分享会的学废菌老板进行分享。
![分享会-10](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760151970005-kkea3zsoi.png)

学废老板，自加入分享会后笔耕不辍，坚持在论坛写帖分享，他的小白攻略帖深受大家喜爱，受我邀请担任分享会学习委员，来给大家进行系列直播。

每次推出新策略和框架后，学废老板都会做针对性直播，帮助大家快速理解掌握，进一步降低了分享会的学习门槛。
![分享会-11](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760161738465-x7yfw6lub.jpeg)

<center>6.牛马船队直播</center>
「牛马船队」系列直播是2024年分享会新增的系列，由分享会牛马船队中的老板们进行分享。

牛马船队集结了分享会的一众卷王们，他们自身足够优秀却仍异常努力。
![分享会-12](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760161856777-xaqgya32v.png)

船队成员进出经过严格的审批，有一定的进入门槛，实行末尾淘汰制。

他们会在我的帮助下进行不同方向的研究，并把部分研究成果分享给所有同学。

24年股票和b圈两个牛马船队总计贡献了51期直播，基本达到了初期目标。
![分享会-13](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760161967693-qtowbs6y5.png)

<center>7.船长直播</center>
船长直播由船队的船长们进行。他们会就分享会的策略、工具、策略代码和精华帖等进行直播讲解。

![分享会-14](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760161980991-922fiwc9l.png)

![分享会-15](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760161992995-vzxjbzf46.png)

![分享会-15.5](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760166556918-6fan6nwfr.png)
<center>五、2025分享会内容：船队</center>

除了直播外，从2021期开始的研究船队活动，是分享会的另一个灵魂。

<center>1.研究船队</center>

25年会围绕（但不限于）以下方向举办大船队：

股票：

1.客户端船队：带新人了解分享会实盘客户端的使用。

2.分析&工具船队：带新人了解各类策略分析工具的使用。

3.选股策略船队：提供若干选股策略，注重策略逻辑的扎实性以及策略的深度理解，25年选股策略的模式也会发生变化。

![分享会-16](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760162211123-cssnfk7tn.png)

4.美股船队：开发针对美股的量化交易策略，实现从策略到全自动实盘的闭环（开船率80%）。

5.仓位管理船队：最重要的船队，贯穿全年，必上。通过一套框架实现策略轮动、仓位管理、择时、风控等需求。

![分享会-17](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760162271749-2ov1gw94r.png)
![分享会-18](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760162274877-z01henx60.png)

6.其他船队：因子工厂船队、事件策略船队等（开船率70%）。

关于股票船队的详细说明，请见2025分享会介绍视频的1:06:45 - 1:18:53

B圈：

1.框架&工具船队：带新人熟悉分享会框架，包括但不限于选B框架、仓位管理框架等。

2.纯多再择时船队：旗舰船队，贯穿全年，必上。为大家额外提供若干选B策略与择时策略。

3.仓位管理船队：进阶船队，通过一套框架实现策略轮动、仓位管理、择时、风控等需求。

4.卖出船队：提供若干种方法，帮助大家的屯B、定投B逃顶。

5.可视化船队：通过实盘配置网页，实现B圈交易简单化。

关于B圈船队的详细说明，请见2025分享会介绍视频的1:19:54 - 1:29:24

分享会的船队会随着行情的变化而变化，所以目前只能简单列出25年1、2季度的股票、b圈船队的方向。

科学家船队：

科学家船队专注区块链自动化操作和B圈基本面的深度研究，包括新B首发打新、低风险套利、使用链上数据构建量化系统等。

关于科学家船队的详细说明，请见西蒙斯的直播介绍。

<center>2.牛马船队</center>

牛马船队是专门为分享会中厉害的卷王们开设的。

（如果说分享会的学习量相当于读研，牛马船队的体验就等于读博）

近期对社区有过贡献的同学可以申请加入牛马船队，同时配合严格的淘汰机制，最终聚拢一批价值观相同、有分享精神、较强研究能力的同学，成为“牛马”。

25年，我会花更多时间在牛马船队，就像带公司的研究团队一样，和大家一起做研究。

每周花至少半天与牛马同学远程讨论（每缺席一次，在牛马群发一万红包），每月至少组织一次线下牛马讨论会（每少组织一次，在牛马群发一万红包），尽我所能帮助船队的研究。
![分享会-19](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760162374448-ujsauswqq.jpeg)

牛马们可自由寻找研究方向，自由组队。我会亲自和你们讨论研究方向、定期meeting、监督进度、商量落地的方式。

如果某个方向我很感兴趣，我还会安排同事和资源加入一同研究。有合适的研究结果，会在分享会向所有同学直播、发帖，甚至纳入官方研究和框架内。
![分享会-20](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760162462240-3npzg8ec0.jpeg)

当然鬼精鬼精的我，也不会白白付出。之所以愿意为船队提供这么多帮助，我也是有要求的：

就是卷王们要和我一起来为大部分躺平的分享会同学服务：部分研究结果，需要通过直播、发帖等方式，和所有分享会同学分享。

（24年牛马船队的同学们为分享会贡献了51期直播。）

真心祝福每位「牛马」的付出终有所获。分享会现在是我的，但将来必然是船长们以及「牛马」们的。

关于牛马船队的详细说明，请见2025分享会介绍视频的1:29:48 - 1:49:06

<center>2.船长介绍</center>

我、专职船长、优秀课程同学等，分别担任不同方向的船长。

![分享会-21](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760162456933-2h6a7xdj0.png)

大家各自挑选船队加入。船长会通过微信群、直播、论坛、任务分配、手把手教学等各种方式，让大家实操起来，完成既定任务。

<center>六、2025分享会内容：论坛、社群、线下</center>

在分享会里，大家可以通过论坛、微信群、线下聚会不断的接触。很多志同道合的同学因此成为了朋友，会一起去泡温泉、按摩、合租，也有成为事业上的伙伴，一起租办公室办公，或成为合伙人。

（但至今还没出过情侣。有了一定要告诉我，结婚我出2万份子钱。）

<center>1.分享会论坛</center>

论坛的「分享会版块」是论坛的精华。参与分享会后，可以获得该板块1年的访问权限。

至今6000篇论坛精华贴，及历届研究小组、绝大部分船队的帖子都可以随便查看。

链接：2024策略分享会精华帖导航

<center>2.微信群</center>

每期分享会成员都有专属的微信群，配有专属助教林奇。

分享会群我会唯一置顶，第一时间关注。各种信息，实盘提醒，策略结果，都会第一时间在群里发布的。
![分享会-23](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760162695339-z4dzlcd8c.jpeg)

<center>3.线下研讨会</center>

线下研讨会是24年新增的活动，目的是让大家可以在线下深入、频繁的讨论量化问题。

研讨会仅限牛马船队同学参与，有时间即可自由报名，主题由我确认，也可大家自行发起。

25年我会保证每个月在全国主要城市至少组织一次线下牛马研讨会。（每有一个月做不到，牛马群发一万红包）
![分享会-19](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760162374448-ujsauswqq.jpeg)

<center>七、2025分享会内容：数据、工具、福利</center>

策略分享会的同学时间宝贵，要尽可能的专注于策略。我们会帮大家把其他耗费精力的杂事都处理掉。

<center>1.低手续费</center>
分享会成员可以独享我为大家申请的股票全网最低手续费（可私信分享会助教林奇了解）和期货全网最低手续费，无任何资金量要求。

<center>2.交易接口、量化工具</center>
还有为分享会成员申请券商专门的股票量化交易软件及接口，24年我们在过往基础上，为大家新增了6家券商做选择，确保了大家利益最大化。

<center>3.数据</center>

经过几年的丰富，网站提供的数据已经非常丰富，完全是一个小型金融数据库了。并且从2022年起，我们还通过API提供了数据的自动更新服务。
![分享会-24](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760162903766-5rq2a0zo1.jpeg)
![分享会-25](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760162954423-ipy23mzwf.jpeg)
![分享会-26](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760163002491-p0h6zcygr.png)

这些数据分享会成员都可以免费使用。并且仍在不断丰富中。

2024年，我们还专门为b圈同学推出链上数据库，包括全量的历史数据及实时API。这些数据在其他平台单独购买的话，都要几万到几十万不等。

<center>4.网站</center>

2019年西蒙斯专门给大家开发了配套的网站「量化小讲堂」，它是我们所有分享内容的承接。

加入分享会，可获得12个月的网站最高权限，免费享受所有服务。

网站上会展示历年分享会策略的历史表现评价及最新信号。比如各类股市选股策略：

![分享会-27](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760162999061-9djczg58b.png)

另外还有各种监测指标，比如股市整体估值监测数据：

![分享会-28](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760163113494-rjoq6bkra.jpg)
![分享会-29](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760163116810-ko8pyux3k.jpg)

<center>5.邢不行客户端</center>
由于分享会的策略越来越完整、越来越多，邮箱下载数据已然不够看，2023年底我们专门为分享会同学提供自己开发的数据客户端。

![分享会-30](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760163196287-de6s1e0sj.png)

和数据API有使用门槛不同，数据客户端的操作更加简便，并且有专门的安装配置教程，保障小白用户也能轻松学会使用。

数据客户端能够承载的数据更多，且订阅的数据会自动更新，免去了多次下载的麻烦。

未来我们也会根据同学们的反馈不断更新优化数据客户端，为大家带来更好的数据支持工作。

24年客户端也做了全面升级，新增了股票自动交易功能，简单配置后即可实现在客户端进行实盘交易，交易难度进一步简化。

![分享会-31](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760163319053-c3gfsj2as.png)

25年我们还会进一步丰富客户端的功能，集成股票回测模块，并逐步嵌入各类分析工具。届时只需要修改少量核心代码即可进行回测，让大家有更多时间和精力放在策略的研究上。

<center>6.b圈实盘网页</center>

2025年西蒙斯会专门给大家开发b圈的实盘配置网页，以供分享会成员免费使用。

未来你只要在网站上点击就可以运行策略的实盘交易，进一步减少编程的压力。

<center>7.其他福利</center>

分享会其实还有很多隐藏的福利。比如23年新增的免FQ的ChatGPT。

链接：国内版GPT介绍

股票船队每个月也都会进行抽奖。

![分享会-32](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760163401862-4wlq41del.jpeg)

分享会还有个灵鹫宫群（指灵活就业），旨在拯救不上班的财务自由大佬们空虚的灵魂。

![分享会-32](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760163398712-kkno2645q.jpg)

链接：灵鹫宫群介绍

<center>八.常见问题</center>

<center>1.关于分享会的时间跨度</center>

2025年分享会时间是从2024年12月7日开始，一直到2025年12月31结束，共13个月，包含2025整个自然年。

从12月7日起，参与的朋友就可以开始享受各种服务。我的直播、船队会从2025年1月正式开始。

另外，如果你已经参加了2025年分享会，又在25年3月1日购买了24年的分享会，那么你的论坛、数据等各类权限会直接往后延期12个月到26年12月31日。

（小建议：如果想参加25年分享会，可以先把24年分享会买了，这样参加25年可以打8折，当然主要还是24年的内容实在太经典，早晚会回过来买。）

<center>2.关于往期分享会</center>

分享会每年内容都是独立的。即你若只加入了2025年分享会，是看不到之前19、20、21、22、23、24六期的策略直播的，只有当期的同学才能看到。

2019、2020期分享会已经绝版，想看的话需要消耗3个金葫芦。

![分享会-32](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760163862391-23btm71wv.png)
长按二维码查看葫芦介绍

2021、2022、2023、2024期目前仍然可付费14888参与，但也即将绝版。届时只能通过消耗金葫芦参与。

同样，2025期分享会的内容也是本期会员独享的，之前、之后的会员都看不到。

所以感兴趣的抓紧加入，越往后价格越贵不说，还会永远买不到。

<center>九、如何参与</center>
参加2025年「策略分享会」，目前价格为12888，之后每新增100人加入，价格增加1000元，永不封顶。

之前参与过分享会的成员8折。打折券已经自动发放，没收到可以先购买，然后私信我退相应款项。

有意向的可以私信邢不行，或直接点击下方立即订阅购买。没有邢不行微信可加

![分享会-33](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760082808519-c4lvjbl8w.png)

相关问题可以添加邢不行微信咨询

最后也是最重要的提示：我有权拒绝任何人参与分享会，已参与的也可退款不再服务，并且可以不给出理由。
![分享会-34](https://quantclasspub.oss-cn-hangzhou.aliyuncs.com/assets/1760164226204-vfaoc1dxa.png)`
